/*Этот код возводит в степень n число x*/
function pow(x, n) {
				let result = x;
				for (let i = 1; i < n; i++) {
				result *= x;
				}
			return result;
			}
//-------------------------------------------------------------------
/*Этот код вычисляет сумму чисел от 1 до n.*/
function sumTo(n) {
  let sum = 0;
  for (let i = 1; i <= n; i++) {
    sum += i;
  }
  return sum;
}
//-------------------------------------------------------------------
/*Этот код возвращает факториал числа n!, используя рекурсивный вызов.*/
function factorial(n) {
  if (n == 1) return 1;
  return n * factorial(n-1);
  }
//-------------------------------------------------------------------
/**/
function fib(n) {
  let a = 1;
  let b = 1;
  for (let i = 3; i <= n; i++) {
    let c = a + b;
    a = b;
    b = c;
  }
  return BigInt(b);
}
//-------------------------------------------------------------------